src/cf/InformationRegisters/ТТС_НаправленияСтанций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТТС_НаправленияСтанций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции_ТТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТТС_НаправленияСтанций/Ext/ManagerModule.bsl
Процедура ЗаписатьНаправлениеСтанции(Станция, Направление) Экспорт
	Запись = РегистрыСведений.ТТС_НаправленияСтанций.СоздатьМенеджерЗаписи();
	Запись.Станция = Станция;
	Запись.Направление = Направление;
	Запись.Записать();
КонецПроцедуры
